blog/app/controllers/photos_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "photos" ("image", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "#<ActionDispatch::Http::UploadedFile:0x0000010c291af0>"], ["article_id", 3], ["created_at", "2015-02-18 17:45:10.460223"], ["updated_at", "2015-02-18 17:45:10.460223"]]
---
	def create
		@article = Article.find(params[:article_id])
		@photo = @article.photos.create(photo_params)