blog/app/controllers/sub_comments_controller.rb

	def create

		@comment = Comment.find(params[:comment_id])
		@sub_comment = @comment.sub_comments.create(sub_comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "sub_comments" ("commenter", "body", "comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "asdasd"], ["body", "sadads"], ["comment_id", 3], ["created_at", "2015-02-17 00:52:41.743470"], ["updated_at", "2015-02-17 00:52:41.743470"]]

	def destroy

		@comment = Comment.find(params[:comment_id])
		@sub_comment = @comment.sub_comments.find(params[:id])
		@sub_comment.destroy
---
SELECT  "sub_comments".* FROM "sub_comments" WHERE "sub_comments"."comment_id" = ? AND "sub_comments"."id" = ? LIMIT 1  [["comment_id", 3], ["id", 1]]
DELETE FROM "sub_comments" WHERE "sub_comments"."id" = ?  [["id", 1]]