blog/app/controllers/youtubes_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@youtube = @article.youtubes.create(youtube_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "youtubes" ("youtube_url", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["youtube_url", "https://www.youtube.com/watch?v=jbsjY4vfbcg"], ["article_id", 13], ["created_at", "2015-02-19 14:22:48.719385"], ["updated_at", "2015-02-19 14:22:48.719385"]]