Looprac/app/controllers/comments_controller.rb

	def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user
    @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Hello"], ["post_id", 1], ["user_id", 1], ["created_at", "2015-03-10 14:42:55.549507"], ["updated_at", "2015-03-10 14:42:55.549507"]]