Looprac/app/controllers/posts_controller.rb

	def create
  		@post = Post.new(post_params)
        @post.user = current_user
  		if @post.save
---
INSERT INTO "posts" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdasdsa"], ["text", "asdas"], ["user_id", 1], ["created_at", "2015-03-10 15:12:48.768670"], ["updated_at", "2015-03-10 15:12:48.768670"]]

	def update
  		@post = Post.find(params[:id])

  		if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "Hello there people and welcome to Looprac."], ["updated_at", "2015-03-10 19:42:18.845617"], ["id", 6]]

    def upvote
     @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]

    def downvote
    	@post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]