Looprac/app/views/comments/_comment.html.erb

		<h4 class="media-heading">
			<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]